retsimx/tlsr8266_mesh/sdk/vendor/light_8269/main_light.c
void light_onoff_hw(u8 on){
    #if LIGHT_ADJUST_STEP_EN
    light_onoff_step(on);
    #else
    light_onoff_normal(on);
	#endif
}

void light_onoff(u8 on){
    light_onoff_hw(on);

	device_status_update();
}

/////////////////// rf interrupt handler ///////////////////////////
_attribute_ram_code_ void irq_handler(void)
{
	irq_light_slave_handler ();

#if UART_ENABLE
    static unsigned char enterRXIrq,enterTXIrq;
    unsigned char irqS = uart_IRQSourceGet();
    if(irqS & UARTRXIRQ_MASK){
        uart_rx_true = 1;
        enterRXIrq++;
    }
    
    if(irqS & UARTTXIRQ_MASK){
        uart_clr_tx_busy_flag();
        enterTXIrq++;
    }
#endif

#if (I2C_HW_MODOULE_EN && I2C_IRQ_EN)
    I2C_IrqSrc i2c_src = I2C_SlaveIrqGet();
    if(I2C_IRQ_NONE != i2c_src){
        I2C_SlaveIrqClr(i2c_src);
    }
#endif
}

void irq_timer0(void){
#if IRQ_TIMER0_ENABLE
	static u8 a_irq_timer0;
	a_irq_timer0++;
#endif
}

#if (SYNC_TIME_EN)
STATIC_ASSERT((SYNC_ALTER_TIME % (IRQ_TIME1_INTERVAL * CLOCK_SYS_CLOCK_1MS) == 0));
STATIC_ASSERT((SYNC_CMD_DELAY_TIME_MS % IRQ_TIME1_INTERVAL) == 0);
STATIC_ASSERT((IRQ_TIME1_INTERVAL >= 10) && (IRQ_TIME1_INTERVAL <= 100));
STATIC_ASSERT((SYNC_CMD_DELAY_TIME_MS == 400) && ((SYNC_CMD_DELAY_TIME_MS / IRQ_TIME1_INTERVAL) <= 255));
STATIC_ASSERT(SYNC_TIME * (CLOCK_SYS_CLOCK_1S/CLOCK_SYS_CLOCK_1MS) > (SYNC_ALTER_TIME/CLOCK_SYS_CLOCK_1MS));
STATIC_ASSERT((SYNC_ALTER_TIME == 100*CLOCK_SYS_CLOCK_1MS)
                   ||(SYNC_ALTER_TIME == 200*CLOCK_SYS_CLOCK_1MS)
                   ||(SYNC_ALTER_TIME == 400*CLOCK_SYS_CLOCK_1MS)
                   ||(SYNC_ALTER_TIME >= 500*CLOCK_SYS_CLOCK_1MS));
STATIC_ASSERT((2*CLOCK_SYS_CLOCK_1S)/SYNC_ALTER_TIME >= 2);

#if(SYNC_ALTER_TIME <= SYNC_CMD_DELAY_TIME_MS*CLOCK_SYS_CLOCK_1MS)
u8 sync_cmd_change_level = (((SYNC_CMD_DELAY_TIME_MS*CLOCK_SYS_CLOCK_1MS)/SYNC_ALTER_TIME)%2 == 1);
#else
u8 sync_cmd_change_level = 0;
#endif
u32 sync_alter_cycle_10ms = SYNC_ALTER_TIME / (IRQ_TIME1_INTERVAL * CLOCK_SYS_CLOCK_1MS);
u32 t1_cycle_tick = (IRQ_TIME1_INTERVAL * CLOCK_SYS_CLOCK_1MS);
u32 sync_near_time2alter = (2*CLOCK_SYS_CLOCK_1S)/SYNC_ALTER_TIME;
u32 sync_10ms_tick_last = 0;

ll_packet_l2cap_data_t sync_cmd_delay;
static u32 sync_alter_cnts;

void sync_alter_action_callback(u8 high)
{
    #if SYNC_LIGHT_ONOFF_EN
    #if 0   // pattern 1
    light_onoff_normal(high);
    #elif 1   // pattern 2
    if((sync_alter_cnts * sync_alter_cycle_10ms) % 350 < 250){
        light_onoff_normal(1);
    }else{
        light_onoff_normal(0);
    }
    sync_alter_cnts++;
    #endif
    #endif
}

void sync_cmd_action_callback(u8 sync_reset)
{
    if(sync_reset){
        sync_alter_cnts = 0;    // init
        // sync by app fuction
    }
}
#endif

void irq_timer1(void){
	static u8 a_irq_timer1;
	a_irq_timer1++;
	if(p_vendor_irq_timer1){
		p_vendor_irq_timer1();
		//return;
	}
	
	if(irq_timer1_cb_time && clock_time_exceed(irq_timer1_cb_time, cmd_left_delay_ms*1000)){
		cmd_left_delay_ms = 0;
		rf_link_data_callback((u8*)(&cmd_delay));
		cmd_delay_ms = irq_timer1_cb_time = 0;
	}
    
    #if (SYNC_TIME_EN)
    // must after rf_link_data_callback()
    sync_time_irq_handle(SYNC_CMD_DELAY_TIME_MS / IRQ_TIME1_INTERVAL, SYNC_TIME2ALTERS);
    #endif
    
    #if LIGHT_ADJUST_STEP_EN
	light_onoff_step_timer();
	#endif

#if UART_ENABLE
    uart_ErrorCLR();
#endif
}

void	cfg_led_event (u32 e)
{
	led_event_pending = e;
}

//////////////////////////////////////////////////////

void	pwm_led_en (int id, int en)
{
	if (id == 0)
	{
		gpio_set_func (PWM_G, en);
	}
	else if (id == 1)
	{
		gpio_set_func (PWM_B, en);
	}
	else if (id == 2)
	{
		gpio_set_func (PWM_R, en);
	}
}

void rf_link_light_event_callback (u8 status)
{
    extern void mesh_node_init ();
	if(status == LGT_CMD_SET_MESH_INFO)
	{
        mesh_node_init();
        device_status_update();
        cfg_led_event(LED_EVENT_FLASH_1HZ_4S);
	}else if(status == LGT_CMD_SET_DEV_ADDR){
        mesh_node_init();
        device_status_update();
        cfg_led_event(LED_EVENT_FLASH_1HZ_4S);
    }else if(status == LGT_CMD_DEL_PAIR){
        cfg_led_event(LED_EVENT_FLASH_1HZ_4S);
    }
#if(MESH_PAIR_ENABLE)
    else if(status == LGT_CMD_MESH_PAIR_TIMEOUT){
        cfg_led_event(LED_EVENT_FLASH_2HZ_2S);
    }
#endif
#if(DUAL_MODE_ADAPT_EN)
    else if(status == LGT_CMD_DUAL_MODE_MESH){
		cfg_led_event(LED_EVENT_FLASH_2HZ_1T);
	}
#endif
}

#if(LIGHT_MODE == LIGHT_MODE_CCT)
const u8 rgb_map[RGB_MAP_MAX][3] = {
	{204,   0,      0},
	{204,   31,     0},
	{204,   77,     0},
	{179,   117,    0},
	{153,   156,    0},
	{133,   179,    3},
	{117,   207,    5},
	{111,   255,    9},
	{99,    255,    15},
	{92,    255,    23},
	{84,    255,    31},
	{79,    255,    38},
	{69,    255,    43},
	{59,    255,    48},
	{56,    255,    56},
	{51,    255,    64},
	{43,    255,    69},
	{38,    255,    74},
	{31,    255,    79},
	{23,    255,    84},
	{18,    255,    89},
	{13,    255,    94},
	{8,     255,    99},
	{3,     255,    107},
	{0,     255,    115},
	{0,     240,    120},
	{0,     230,    128},
	{0,     217,    133},
	{0,     209,    140},
	{0,     196,    145},
	{0,     184,    153},
	{0,     176,    158},
	{0,     166,    163},
	{0,     156,    168},
	{0,     145,    173},
	{0,     138,    179},
	{0,     128,    184},
	{0,     117,    186},
	{0,     110,    194},
	{0,     99,     196},
	{0,     92,     204},
	{0,     84,     207},
	{0,     77,     212},
	{0,     69,     217},
	{0,     61,     219},
	{0,     54,     224},
	{0,     46,     230},
	{0,     38,     235},
	{0,     31,     237},
	{0,     23,     242},
	{0,     15,     245},
};
#else //if(LIGHT_MODE == LIGHT_MODE_RGB)
const u8 rgb_map[RGB_MAP_MAX][3] = {
	{	4	,	255 ,	128 },
	{	8	,	252 ,	132 },
	{	12	,	248 ,	136 },
	{	16	,	244 ,	140 },
	{	20	,	240 ,	144 },
	{	24	,	236 ,	148 },
	{	28	,	232 ,	152 },
	{	32	,	228 ,	156 },
	{	36	,	224 ,	160 },
	{	40	,	220 ,	164 },
	{	44	,	216 ,	168 },
	{	48	,	212 ,	172 },
	{	52	,	208 ,	176 },
	{	56	,	204 ,	180 },
	{	60	,	200 ,	184 },
	{	64	,	196 ,	188 },
	{	68	,	192 ,	192 },
	{	72	,	188 ,	196 },
	{	76	,	184 ,	200 },
	{	80	,	180 ,	204 },
	{	84	,	176 ,	208 },
	{	88	,	172 ,	212 },
	{	92	,	168 ,	216 },
	{	96	,	164 ,	220 },
	{	100 ,	160 ,	224 },
	{	104 ,	156 ,	228 },
	{	108 ,	152 ,	232 },
	{	112 ,	148 ,	236 },
	{	116 ,	144 ,	240 },
	{	120 ,	140 ,	244 },
	{	124 ,	136 ,	248 },
	{	128 ,	132 ,	252 },
	{	132 ,	128 ,	255 },
	{	136 ,	124 ,	4	},
	{	140 ,	120 ,	8	},
	{	144 ,	116 ,	12	},
	{	148 ,	112 ,	16	},
	{	152 ,	108 ,	20	},
	{	156 ,	104 ,	24	},
	{	160 ,	100 ,	28	},
	{	164 ,	96	,	32	},
	{	168 ,	92	,	36	},
	{	172 ,	88	,	40	},
	{	176 ,	84	,	44	},
	{	180 ,	80	,	48	},
	{	184 ,	76	,	52	},
	{	188 ,	72	,	56	},
	{	192 ,	68	,	60	},
	{	196 ,	64	,	64	},
	{	200 ,	60	,	68	},
	{	204 ,	56	,	72	},
	{	208 ,	52	,	76	},
	{	212 ,	48	,	80	},
	{	216 ,	44	,	84	},
	{	220 ,	40	,	88	},
	{	224 ,	36	,	92	},
	{	228 ,	32	,	96	},
	{	232 ,	28	,	100 },
	{	236 ,	24	,	104 },
	{	240 ,	20	,	108 },
	{	244 ,	16	,	112 },
	{	248 ,	12	,	116 },
	{	252 ,	8	,	120 },
	{	255 ,	4	,	124 },
};
#endif

static  int led_count = 0;

