retsimx/tlsr8266_mesh/sdk/vendor/light_8269/main_light.c
	rf_link_slave_set_buffer (buff_response[0], 48);

	//rf_link_set_debug_adv_channel (38);

	rf_link_set_max_bridge (BRIDGE_MAX_CNT);
	vendor_id_init(VENDOR_ID);
	
	usb_dp_pullup_en (1);

	//extern void	rf_link_set_max_relay (u8 num);
	//rf_link_set_max_relay (3);
	
	light_hw_timer0_config();
	light_hw_timer1_config();

	extern u32 online_status_timeout;
    online_status_timeout = ONLINE_STATUS_TIMEOUT;
    
#if(PA_ENABLE)
    pa_init(0, 0);
#endif

#if(SCENE_EN)
    scene_init();
#endif

#if(MESH_PAIR_ENABLE)
	mesh_pair_init();
#endif
}

void light_set_master_data(void){
	// write_master_data means need to send some data to master,just padding data into send_to_master[]
	if(write_master_data){
		write_master_data = 0;
		memcpy(send_to_master, (u8*)&slave_send_data, 4);
	}
}

void light_auth_check(void){
	if(security_enable && !pair_login_ok && slave_first_connected_tick && clock_time_exceed(slave_first_connected_tick, AUTH_TIME*1000*1000)){
		//rf_link_slave_disconnect(); // must login in 60s after connected, if need
		slave_first_connected_tick = 0;
	}
}

void light_user_func(void){
	light_set_master_data();
	
	light_auth_check();

    extern int factory_reset_cnt_check ();
	factory_reset_cnt_check();
	
	// save current lum-val
	if(lum_changed_time && clock_time_exceed(lum_changed_time, 5000*1000)){
		lum_changed_time = 0;
		light_lum_store();
	}

	// music function timeout
	if(last_music_tick && clock_time_exceed(last_music_tick, 3000*1000)){
	    music_time = last_music_tick = 0;
        led_lum = led_lum_tmp;
        light_adjust_RGB(led_val[0], led_val[1], led_val[2], led_lum);
	}

#if(MESH_PAIR_ENABLE)
	mesh_pair_proc_effect();
#endif
    
#if(BQB_EN)	// trigger to BQB mode, user should redefine here
	static u32 bqb_start_time = 0;
    if(!bqb_en_flag && !bqb_start_time && clock_time_exceed(bqb_start_time, 5000*1000)){
        bqb_start_time = clock_time() | 1;
		analog_write(rega_bqb_reboot, BQB_MODE_FLAG);
		light_sw_reboot();
    }
#endif
}

////////////////////////////////////////////////////////////////////////////
void main_loop(void)
{
	static u32  dbg_m_loop;
	dbg_m_loop++;
	
	if(is_receive_ota_window()){
		return ;
	}

#if(BQB_EN)
	if(bqb_en_flag == 1){
	    static u8 irq_flag = 1;
	    if(irq_flag){
	        irq_flag = 0;
            irq_disable();
	    }
		extern void main_loop_bqb(void);
		main_loop_bqb();
		return;
	}
#endif

	//flash_protect_debug();
	
#if(ALARM_EN)
	alarm_handle();
#endif

#if(SCENE_EN)
	scene_handle();
#endif	
    
	//light_sim_light2light();
	//light_sim_notify();
#if(LIGHT_NOTIFY_MESH_EN)
	light_sim_notify_mesh();
#endif	

	light_user_func ();
	
	rf_link_slave_proc ();

	proc_led ();
#if (BATT_CHECK_ENABLE)
    app_battery_power_check_and_sleep_handle(1);
#endif
#if GATEWAY_EN
    proc_ui_gateway ();
#endif    

#if(STACK_CHECK_ENABLE)
    stack_check();
#endif

	//proc_debug ();

#if DEUBG_UART_TEXT_EN
	printf ("main loop: %d\r\n", dbg_m_loop);
	sleep_us (100000);
#endif

#if DEUBG_UART_HEX_EN
	USBUART (dbg_m_loop>>24);
	USBUART (dbg_m_loop>>16);
	USBUART (dbg_m_loop>>8);
	USBUART (dbg_m_loop);
#endif

#if UART_ENABLE 
    if(uart_rx_true){
        uart_rx_true = 0;
        u32 rx_len = T_rxdata_buf.len + 4 > sizeof(T_rxdata_user) ? sizeof(T_rxdata_user) : T_rxdata_buf.len + 4;
        memcpy(&T_rxdata_user, &T_rxdata_buf, rx_len);
        uart_Send((u8 *)(&T_rxdata_user));
    }
#endif

#if ADC_ENABLE
    static u32 adc_check_time;
    if(clock_time_exceed(adc_check_time, 1000*1000)){
        adc_check_time = clock_time();
        static u16 T_adc_val;
        T_adc_val = adc_BatteryValueGet();
    }    
#endif
#if ADC_SET_CHN_ENABLE
	static u32 adc_tmp_check_time;
	if(clock_time_exceed(adc_tmp_check_time, 40*1000)){
        adc_tmp_check_time = clock_time();
        u32 v_ref = 3300;
        if (ADC_CHNM_REF_SRC_8269 == RV_AVDD){      // can not use "#if" because of enum
            v_ref = 3300;
        }else if(ADC_CHNM_REF_SRC_8269 == RV_1P224){
            v_ref = 1224;
        }else if(ADC_CHNM_REF_SRC_8269 == RV_1P428){
            v_ref = 1428;
        }
        static u32 T_adc_val_tmp;
		static u32 T_adc_mv;
        T_adc_val_tmp = adc_SampleValueGet() & 0x3FFF;
		T_adc_mv = (T_adc_val_tmp * v_ref) >> 14 ;
    }
#endif

#if  ADC_TEMP_ENABLE
	adc_adj_tp_handle();
#endif

#if FEATURE_FRIEND_EN
    friendship_proc_fn();
#endif

#if DUAL_MODE_ADAPT_EN
    dual_mode_loop_proc();
#endif

#if NOTIFY_MESH_FIFO_EN
    notify_mesh_fifo_proc ();
#endif

#if NOTIFY_MESH_COMMAND_TO_MASTER_EN
    nctm_loop();
#endif
}

////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////

void  user_init(void)
{
    #if (BATT_CHECK_ENABLE)
    app_battery_power_check_and_sleep_handle(0); //battery check must do before OTA relative operation
    #endif
	blc_readFlashSize_autoConfigCustomFlashSector();
#if(BQB_EN)
	if(BQB_MODE_FLAG == analog_read(rega_bqb_reboot)){
		#if(MODULE_WATCHDOG_ENABLE)
		wd_stop();
		#endif
		Bqb_Init();
		bqb_en_flag = 1;
		return;
	}
#endif

#if DUAL_MODE_ADAPT_EN
	dual_mode_en_init();    // must before factory_reset_handle and erase ota data, because "dual_mode_state" is used in it.
#endif

    flash_get_id();
    
#if 1	
	// for app ota   
	if(0 == is_ota_area_valid(ota_program_offset)){ // 8267 / 8269 should use "ota_program_offset"
		erase_ota_data(ota_program_offset);
	}
#endif
	
    flash_protect_8267_normal();    // must after erase_sector for OTA

#if ADC_TEMP_ENABLE || ADC_SET_CHN_ENABLE || ADC_ENABLE
	adc_Init();
	adc_chn_ref_init();
#endif

	extern void set_vendor_function(void);
	set_vendor_function();

	light_init_default();

	if(p_vendor_user_init){
		p_vendor_user_init();
	}else{
		REG_ADDR8(0x5b1) = 0x0;     // set default  function Mux to PWM
		REG_ADDR8(0x5b4) |= 0x3;    // set default  function Mux to PWM for PE0/PE1
		pwm_set (PWMID_R, PMW_MAX_TICK, PMW_MAX_TICK);
		pwm_set (PWMID_G, PMW_MAX_TICK, PMW_MAX_TICK);
		pwm_set (PWMID_B, PMW_MAX_TICK, PMW_MAX_TICK);
		
		//retrieve lumen value
		light_lum_retrieve();

		pwm_start (PWMID_R);
		pwm_start (PWMID_G);
		pwm_start (PWMID_B);
		
		gpio_set_func (PWM_R, !AS_GPIO);
		gpio_set_func (PWM_G, !AS_GPIO);
		gpio_set_func (PWM_B, !AS_GPIO);
	}
	
#if (SW_NO_PAIR_ENABLE)
	extern u8 sw_no_pair;
	sw_no_pair = 1;
#endif
	rf_link_slave_init (40000);

    extern int factory_reset_handle ();
    factory_reset_handle();

