retsimx/tlsr8266_mesh/sdk/vendor/light_8269/main_light.c
	extern void vendor_set_adv_data(void);
	vendor_set_adv_data();

#if UART_ENABLE
    //Initial IO
    //UART_GPIO_CFG_PA6_PA7();
    //UART_GPIO_CFG_PC2_PC3();
    UART_GPIO_CFG_PB2_PB3();
    
    CLK32M_UART115200;
    uart_BuffInit((u8 *)(&T_rxdata_buf), sizeof(T_rxdata_buf), (u8 *)(&T_txdata_buf));
#endif	
	
#if(IBEACON_ENABLE)
	#if 0 // apple ibeacon
    if (*(u16 *) FLASH_ADR_BEACON_MAJOR != 0xFFFF){
    	u16 major_data = *(u16 *) FLASH_ADR_BEACON_MAJOR;
    	major_data = (major_data << 8) | ((major_data >> 8) & 0x00FF);
        ibeacon_customer_data.major = major_data;
    }
    if (*(u16 *) FLASH_ADR_BEACON_MINOR != 0xFFFF){
    	u16 minor_data = *(u16 *) FLASH_ADR_BEACON_MINOR;
    	minor_data = (minor_data << 8) | ((minor_data >> 8) & 0x00FF);
        ibeacon_customer_data.minor = minor_data;
    }
    if (*(u32 *) FLASH_ADR_BEACON_UUID != 0xFFFFFFFF){
		u8 customer_UUID[16] = {0};
    	flash_read_page(FLASH_ADR_BEACON_UUID, 16, customer_UUID);
		memcpy(ibeacon_customer_data.proximity_UUID, customer_UUID, 16);
    }
    if (*(u16 *) FLASH_ADR_BEACON_COMPANYID != 0xFFFF){
		ibeacon_customer_data.company_ID = *(u16 *) FLASH_ADR_BEACON_COMPANYID;
    }
    
    beacon_len = sizeof(ibeacon_adv_t);
    memcpy(iBeaconData, &ibeacon_customer_data, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
	#endif
    #if 0 // eddystone UID
    extern u8 mac_id[];
    memcpy(eddystone_uid + 23, mac_id, 6);
    beacon_len = 31;
    memcpy(iBeaconData, eddystone_uid, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
    #endif
    #if 0 // eddystone URL
    beacon_len = eddystone_url[0]+eddystone_url[3]+eddystone_url[7]+3;
    memcpy(iBeaconData, eddystone_url, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
    #endif
    #if 0 // eddystone TLM
    beacon_len = 25;
    memcpy(iBeaconData, eddystone_tlm, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
    #endif
    iBeaconInterval = IBEACON_INTERVAL;
	beacon_with_mesh_adv = 1;
#endif

#if(STACK_CHECK_ENABLE)
    stack_check_init();
#endif

#if (SYNC_TIME_EN)
    sync_time_en(1);
#endif    
	device_status_update();
    mesh_security_enable (1);
	
	if(!security_enable){
	    //not_need_login = pair_login_ok = 1;// 1 means not need login when no-security mode.
	}else{
	    //extern u8 rands_fix_flag;
        //rands_fix_flag = 1;       // 1 means rands[8] = {0xb0, 0xb1, 0xb2, 0xb3, 0xb4, 0xb5, 0xb6, 0xb7};
	}

#if GATEWAY_EN
    gateway_init();
    gateway_mode_onoff(1);
    gateway_security = 0;
    gateway_set_login_flag();
#endif

    #if 0// callback for node status changed
    extern void light_node_status_change_cb(u8 *p, u8 new_node);
    extern void	register_mesh_node_status_callback (void *p);
    register_mesh_node_status_callback(&light_node_status_change_cb);
    #endif

    #if 0// 'set_mesh_info_time' means after this time from power-on,set mesh info will be refused.
    extern u32 set_mesh_info_time;// unit: s
    set_mesh_info_time = 30;
    #endif
    
    #if 0
    extern u8 send_adv_flag; // default value is 1, 0 means don't send adv pkt.
    send_adv_flag = 0;
    #endif
    
#if I2C_HW_MODOULE_EN   // I2C init
    i2c_pin_initial(PIN_I2C_SDA, PIN_I2C_SCL);    // must after light_lum_retrieve() for 8267 / 8269
    #if I2C_MASTER_MODE
    i2c_init(); // master mode
    #else
    i2c_slave_init(I2C_IRQ_EN); // slave mode
    #endif
#endif

    register_mesh_ota_master_ui(mesh_ota_master_led);   //  mesh_ota_master_led() will be called when sending mesh ota data.

#if FN_DEBUG_PIN_EN
    fn_debug_gpio_init();
#endif

#if (DUAL_MODE_ADAPT_EN)
    dual_mode_sig_mesh_par_init();
#endif

#if NOTIFY_MESH_COMMAND_TO_MASTER_EN
    nctm_user_init();
#endif
}
#endif

